Revit 2027 API
EnergyAnalysisWindowType.WindowTypeName Property
 The name of the window type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string WindowTypeName { get; }
Public ReadOnly Property WindowTypeName As String
	Get
public:
property String^ WindowTypeName {
	String^ get ();
}
member WindowTypeName : string with get
Property Value
String
See Also
Reference
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace